# -*- coding: utf-8 -*-
"""
第四章实战
"""

#%% 1

print("“王者荣耀”游戏角色：")
list_w=["===坦克===：\n苏烈，刘邦",
        "===战士===：\n狂铁，fei擒虎",
        "===刺客===：\n百里玄策，庞统",
        "===法师===：\n杨玉环，奕星",
        "===射手===：\n公孙离，百里守约",
        "===辅助===：\n明世隐，梦奇"]
for item in list_w:
    print(item)
    

#%% 2


print('''
      车次  出发站-到达站  出发时间  到达时间  历时
      T40   长春-北京      00：12   12:20    12:08
      T298  长春-北京      00:06    0        0
      Z158  长春-北京      12:48    0        0
      Z62   长春-北京      21；58   0        0''')

list_h=['T40','T298','Z158','Z62']
list_v=['长春-北京      00：12',
        '长春-北京      00:06',
        '长春-北京      12:48',
        '长春-北京      21；58']
dictionary=dict(zip(list_h,list_v))

var=str(input("请输入要购买的车次："))
var_name=str(input("请输入乘车人（用逗号分隔）："))
information=dictionary[var]

print('您已购'+var+'次列车  '+str(information)+'开，请'+var_name+'尽快换取纸质车票。【铁路客服】')


#%% 3

list_num=[1.4, 1.343, 0.92, 0.862, 0.553, 0.411, 0.164, 0.259, 0.394, 0.562]                                                                                                                                                                                                                                                                           
list_name=['《G》', '《T1》', '《M1》', '《N》',  '《I》', '《S》', '《E》', 
           '《T2》', '《D》', '《M2》',]   
tv=dict(zip(list_num,list_name))   
list_num.sort(reverse=True)
print('电视剧的收视率排行榜：')
for item in list_num:
    print(tv[item]+'收视率：'+str(item)+'%')


#%% 4

ti={'1':'0分钟', '2':'50分钟', '3':'100分钟', '4':'300分钟', '5':'不限量'}
ba={'1':'0M', '2':'500M', '3':'1G', '4':'5G', '5':'不限量'}
me={'1':'0条', '2':'50条', '3':'100条'}

print('定制自己的手机套餐')
print('''
      A.请设置通话时长：
      1.0分钟
      2.50分钟
      3.100分钟
      4.300分钟
      5.不限量
      ''')
ti_number=str(input('输入选择的通话时长编号：'))
print('''
      B.请设置流量包：
      1.0M
      2.500M
      3.1G
      4.5G
      5.不限量
      ''')
ba_number=str(input('输入选择的流量包编号：'))
print('''
      C.请设置短信条数：
      1.0条
      2.50条
      3.100条
      ''')
me_number=str(input('输入选择的短信条数编号：'))

print('您的手机套餐定制成功：免费通话时长为'+str(ti[ti_number])+'/月，流量为'
      +str(ba[ba_number])+'/月，短信条数'+str(me[me_number])+'/月')
















